witalis3/UA3REO-DDC-Transceiver/STM32/WOLF-X1/Src/front_unit.c
PERIPH_FrontPanel_Button PERIPH_FrontPanel_TANGENT_MH48[6] = {
	{.port = 1, .channel = 1, .type = FUNIT_CTRL_BUTTON, .tres_min = 1600, .tres_max = 2200, .state = false, .prev_state = false, .work_in_menu = false, .parameter = 0, .clickHandler = BUTTONHANDLER_DOWN, .holdHandler = BUTTONHANDLER_DOWN},	 //PTT_SW1 - DOWN
	{.port = 1, .channel = 1, .type = FUNIT_CTRL_BUTTON, .tres_min = 1000, .tres_max = 1500, .state = false, .prev_state = false, .work_in_menu = false, .parameter = 0, .clickHandler = BUTTONHANDLER_UP, .holdHandler = BUTTONHANDLER_UP},		 //PTT_SW1 - UP
	{.port = 1, .channel = 2, .type = FUNIT_CTRL_BUTTON, .tres_min = 1000, .tres_max = 1500, .state = false, .prev_state = false, .work_in_menu = false, .parameter = 0, .clickHandler = BUTTONHANDLER_VLT, .holdHandler = BUTTONHANDLER_PRE},		 //PTT_SW2 - P1
	{.port = 1, .channel = 2, .type = FUNIT_CTRL_BUTTON, .tres_min = 1500, .tres_max = 2100, .state = false, .prev_state = false, .work_in_menu = false, .parameter = 0, .clickHandler = BUTTONHANDLER_AsB, .holdHandler = BUTTONHANDLER_ArB},		 //PTT_SW2 - P2
	{.port = 1, .channel = 2, .type = FUNIT_CTRL_BUTTON, .tres_min = 2100, .tres_max = 2600, .state = false, .prev_state = false, .work_in_menu = false, .parameter = 0, .clickHandler = BUTTONHANDLER_BAND_N, .holdHandler = BUTTONHANDLER_MODE_N}, //PTT_SW2 - P3
	{.port = 1, .channel = 2, .type = FUNIT_CTRL_BUTTON, .tres_min = 2700, .tres_max = 3100, .state = false, .prev_state = false, .work_in_menu = false, .parameter = 0, .clickHandler = BUTTONHANDLER_BAND_P, .holdHandler = BUTTONHANDLER_MODE_P}, //PTT_SW2 - P4
};

void FRONTPANEL_ENCODER_checkRotate(void)
{
	static uint32_t ENCstartMeasureTime = 0;
	static int16_t ENCticksInInterval = 0;
	static float32_t ENCAcceleration = 0;
	static uint8_t ENClastClkVal = 0;
	static bool ENCfirst = true;
	uint8_t ENCODER_DTVal = HAL_GPIO_ReadPin(ENC_DT_GPIO_Port, ENC_DT_Pin);
	uint8_t ENCODER_CLKVal = HAL_GPIO_ReadPin(ENC_CLK_GPIO_Port, ENC_CLK_Pin);

	for(uint16_t recheck = 0; recheck < 64; recheck++)
	{
		if(ENCODER_DTVal != HAL_GPIO_ReadPin(ENC_DT_GPIO_Port, ENC_DT_Pin))
			return;
		if(ENCODER_CLKVal != HAL_GPIO_ReadPin(ENC_CLK_GPIO_Port, ENC_CLK_Pin))
			return;
	}
	
	if (ENCfirst)
	{
		ENClastClkVal = ENCODER_CLKVal;
		ENCfirst = false;
	}
	if ((HAL_GetTick() - ENCODER_AValDeb) < CALIBRATE.ENCODER_DEBOUNCE)
		return;

	if (ENClastClkVal != ENCODER_CLKVal)
	{
		if (!CALIBRATE.ENCODER_ON_FALLING || ENCODER_CLKVal == 0)
		{
			if (ENCODER_DTVal != ENCODER_CLKVal)
			{ // If pin A changed first - clockwise rotation
				ENCODER_slowler--;
				if (ENCODER_slowler <= -CALIBRATE.ENCODER_SLOW_RATE)
				{
					//acceleration
					ENCticksInInterval++;
					if ((HAL_GetTick() - ENCstartMeasureTime) > CALIBRATE.ENCODER_ACCELERATION)
					{
						ENCstartMeasureTime = HAL_GetTick();
						ENCAcceleration = (10.0f + ENCticksInInterval - 1.0f) / 10.0f;
						ENCticksInInterval = 0;
					}
					//do rotate
					FRONTPANEL_ENCODER_Rotated(CALIBRATE.ENCODER_INVERT ? ENCAcceleration : -ENCAcceleration);
					ENCODER_slowler = 0;
					if(TRX_ScanMode) {
						TRX_ScanMode = false;
						LCD_UpdateQuery.TopButtons = true;
					}
				}
			}
			else
			{ // otherwise B changed its state first - counterclockwise rotation
				ENCODER_slowler++;
				if (ENCODER_slowler >= CALIBRATE.ENCODER_SLOW_RATE)
				{
					//acceleration
					ENCticksInInterval++;
					if ((HAL_GetTick() - ENCstartMeasureTime) > CALIBRATE.ENCODER_ACCELERATION)
					{
						ENCstartMeasureTime = HAL_GetTick();
						ENCAcceleration = (10.0f + ENCticksInInterval - 1.0f) / 10.0f;
						ENCticksInInterval = 0;
					}
					//do rotate
					FRONTPANEL_ENCODER_Rotated(CALIBRATE.ENCODER_INVERT ? -ENCAcceleration : ENCAcceleration);
					ENCODER_slowler = 0;
					if(TRX_ScanMode) {
						TRX_ScanMode = false;
						LCD_UpdateQuery.TopButtons = true;
					}
				}
			}
		}
		ENCODER_AValDeb = HAL_GetTick();
		ENClastClkVal = ENCODER_CLKVal;
	}
}

void FRONTPANEL_ENCODER2_checkRotate(void)
{
	uint8_t ENCODER2_DTVal = HAL_GPIO_ReadPin(ENC2_DT_GPIO_Port, ENC2_DT_Pin);
	uint8_t ENCODER2_CLKVal = HAL_GPIO_ReadPin(ENC2_CLK_GPIO_Port, ENC2_CLK_Pin);

	if ((HAL_GetTick() - ENCODER2_AValDeb) < CALIBRATE.ENCODER2_DEBOUNCE)
		return;

	if (!CALIBRATE.ENCODER_ON_FALLING || ENCODER2_CLKVal == 0)
	{
		if (ENCODER2_DTVal != ENCODER2_CLKVal)
		{ // If pin A changed first - clockwise rotation
			FRONTPANEL_ProcessEncoder2 = CALIBRATE.ENCODER2_INVERT ? 1 : -1;
		}
		else
		{ // otherwise B changed its state first - counterclockwise rotation
			FRONTPANEL_ProcessEncoder2 = CALIBRATE.ENCODER2_INVERT ? -1 : 1;
		}
		if(TRX_ScanMode) {
			TRX_ScanMode = false;
			LCD_UpdateQuery.TopButtons = true;
		}
	}
	ENCODER2_AValDeb = HAL_GetTick();
}

static void FRONTPANEL_ENCODER_Rotated(float32_t direction) // rotated encoder, handler here, direction -1 - left, 1 - right
{
	TRX_Inactive_Time = 0;
	if (TRX.Locked || LCD_window.opened)
		return;
	if (LCD_systemMenuOpened)
	{
		FRONTPANEL_ProcessEncoder1 = (int8_t)direction;
		return;
	}
	if (fabsf(direction) <= ENCODER_MIN_RATE_ACCELERATION)
		direction = (direction < 0.0f) ? -1.0f : 1.0f;

	if (TRX.RIT_Enabled) {
		TRX_RIT += direction * 10;
		TRX_RIT = (TRX_RIT / 10) * 10;
		
		if(TRX_RIT < -TRX.RIT_INTERVAL)
			TRX_RIT = -TRX.RIT_INTERVAL;
		if(TRX_RIT > TRX.RIT_INTERVAL)
			TRX_RIT = TRX.RIT_INTERVAL;
		LCD_UpdateQuery.StatusInfoGUI = true;
		TRX_XIT = 0;
		TRX_setFrequency(CurrentVFO->Freq, CurrentVFO);
		return;
	}
	
	if (TRX.XIT_Enabled) {
		TRX_XIT += direction * 10;
		TRX_XIT = (TRX_XIT / 10) * 10;
		
		if(TRX_XIT < -TRX.XIT_INTERVAL)
			TRX_XIT = -TRX.XIT_INTERVAL;
		if(TRX_XIT > TRX.XIT_INTERVAL)
			TRX_XIT = TRX.XIT_INTERVAL;
		LCD_UpdateQuery.StatusInfoGUI = true;
		TRX_RIT = 0;
		TRX_setFrequency(CurrentVFO->Freq, CurrentVFO);
		return;
	}
	
	float64_t newfreq = CurrentVFO->Freq;
	if (TRX.ChannelMode && getBandFromFreq(CurrentVFO->Freq, false) != -1 && BANDS[getBandFromFreq(CurrentVFO->Freq, false)].channelsCount > 0)
	{
		int_fast8_t band = getBandFromFreq(CurrentVFO->Freq, false);
		int_fast8_t channel = getChannelbyFreq(CurrentVFO->Freq, false);
		int_fast8_t new_channel = channel + direction;
		if(new_channel < 0)
			new_channel = BANDS[band].channelsCount - 1;
		if(new_channel >= BANDS[band].channelsCount)
			new_channel = 0;
		
		newfreq = BANDS[band].channels[new_channel].rxFreq;
		TRX.SPLIT_Enabled = (BANDS[band].channels[new_channel].rxFreq != BANDS[band].channels[new_channel].txFreq);
		if(TRX.SPLIT_Enabled)
			TRX_setFrequency(BANDS[band].channels[new_channel].txFreq, SecondaryVFO);
		LCD_UpdateQuery.FreqInfoRedraw = true;
		LCD_UpdateQuery.StatusInfoGUI = true;
		LCD_UpdateQuery.StatusInfoBarRedraw = true;
	}
	else if (TRX.Fast)
	{
		float64_t step = TRX.FRQ_FAST_STEP;
		if (CurrentVFO->Mode == TRX_MODE_CW)
					step = step / (float64_t)TRX.FRQ_CW_STEP_DIVIDER;
		
		if (direction == -1.0f)
			newfreq = ceill(newfreq / step) * step;
		if (direction == 1.0f)
			newfreq = floorl(newfreq / step) * step;
		newfreq = newfreq + step * direction;
	}
	else
	{
		float64_t step = TRX.FRQ_STEP;
		if (CurrentVFO->Mode == TRX_MODE_CW)
					step = step / (float64_t)TRX.FRQ_CW_STEP_DIVIDER;
		
		if (direction == -1.0f)
			newfreq = ceill(newfreq / step) * step;
		if (direction == 1.0f)
			newfreq = floorl(newfreq / step) * step;
		newfreq = newfreq + step * direction;
	}
	
	TRX_setFrequency(newfreq, CurrentVFO);
	LCD_UpdateQuery.FreqInfo = true;
	NeedSaveSettings = true;
}

static void FRONTPANEL_ENCODER2_Rotated(int8_t direction) // rotated encoder, handler here, direction -1 - left, 1 - right
{
	TRX_Inactive_Time = 0;
	if (TRX.Locked || LCD_window.opened)
		return;

	if (LCD_systemMenuOpened)
	{
		SYSMENU_eventSecRotateSystemMenu(direction);
		return;
	}
	
	if (TRX.ENC2_func_mode == ENC_FUNC_SET_WPM && CurrentVFO->Mode != TRX_MODE_CW) // no WPM if not CW
		TRX.ENC2_func_mode = ENC_FUNC_PAGER;
	if (TRX.ENC2_func_mode == ENC_FUNC_SET_RIT && ((!TRX.RIT_Enabled && !TRX.XIT_Enabled) || !TRX.FineRITTune)) // nothing to RIT tune
		TRX.ENC2_func_mode = ENC_FUNC_PAGER;
	if (TRX.ENC2_func_mode == ENC_FUNC_SET_NOTCH && !CurrentVFO->ManualNotchFilter) // nothing to NOTCH tune
		TRX.ENC2_func_mode = ENC_FUNC_PAGER;
	if (TRX.ENC2_func_mode == ENC_FUNC_SET_LPF && CurrentVFO->Mode == TRX_MODE_WFM) // nothing to LPF tune
		TRX.ENC2_func_mode = ENC_FUNC_PAGER;
	if (TRX.ENC2_func_mode == ENC_FUNC_SET_HPF && CurrentVFO->Mode != TRX_MODE_LSB && CurrentVFO->Mode != TRX_MODE_USB) // fast tune HPF in SSB only
		TRX.ENC2_func_mode = ENC_FUNC_PAGER;
	if (TRX.ENC2_func_mode == ENC_FUNC_SET_SQL && !CurrentVFO->SQL) // nothing to SQL tune
		TRX.ENC2_func_mode = ENC_FUNC_PAGER;
	
	if (TRX.ENC2_func_mode== ENC_FUNC_PAGER) //buttons pager
	{
		if(direction < 0)
			BUTTONHANDLER_LEFT_ARR(0);
		if(direction > 0)
			BUTTONHANDLER_RIGHT_ARR(0);
	}
	if (TRX.ENC2_func_mode == ENC_FUNC_FAST_STEP) //fast step mode
	{
		if(TRX_on_TX) return;
		
		float64_t newfreq = (float64_t)CurrentVFO->Freq;
		float64_t step = 0;
		if (TRX.ChannelMode && getBandFromFreq(CurrentVFO->Freq, false) != -1 && BANDS[getBandFromFreq(CurrentVFO->Freq, false)].channelsCount > 0)
		{
			int_fast8_t band = getBandFromFreq(CurrentVFO->Freq, false);
			int_fast8_t channel = getChannelbyFreq(CurrentVFO->Freq, false);
			int_fast8_t new_channel = channel + direction;
			if(new_channel < 0)
				new_channel = BANDS[band].channelsCount - 1;
			if(new_channel >= BANDS[band].channelsCount)
				new_channel = 0;
			
			newfreq = BANDS[band].channels[new_channel].rxFreq;
			TRX.SPLIT_Enabled = (BANDS[band].channels[new_channel].rxFreq != BANDS[band].channels[new_channel].txFreq);
			if(TRX.SPLIT_Enabled)
				TRX_setFrequency(BANDS[band].channels[new_channel].txFreq, SecondaryVFO);
			LCD_UpdateQuery.FreqInfoRedraw = true;
			LCD_UpdateQuery.StatusInfoGUI = true;
			LCD_UpdateQuery.StatusInfoBarRedraw = true;
		}
		else if (TRX.Fast)
		{
			step = TRX.FRQ_ENC_FAST_STEP;
			if (CurrentVFO->Mode == TRX_MODE_WFM)
				step = step * 2.0;
			if (CurrentVFO->Mode == TRX_MODE_CW)
				step = step / (float64_t)TRX.FRQ_CW_STEP_DIVIDER;
			
			if (direction == -1.0f)
				newfreq = ceill(newfreq / step) * step;
			if (direction == 1.0f)
				newfreq = floorl(newfreq / step) * step;
			newfreq = newfreq + step * direction;
		}
		else
		{
			step = TRX.FRQ_ENC_STEP;
			if (CurrentVFO->Mode == TRX_MODE_WFM)
				step = step * 2.0;
			if (CurrentVFO->Mode == TRX_MODE_CW)
				step = step / (float64_t)TRX.FRQ_CW_STEP_DIVIDER;
			
			if (direction == -1.0f)
				newfreq = ceill(newfreq / step) * step;
			if (direction == 1.0f)
				newfreq = floorl(newfreq / step) * step;
			newfreq = newfreq + step * direction;
		}
			
		TRX_setFrequency(newfreq, CurrentVFO);
		LCD_UpdateQuery.FreqInfo = true;
	}
	
